Tekla.Structures.Catalogs.ProfileItem
The ProfileItem abstract class contains the common information of catalog
profiles (parametric and library).

Tekla.Structures.Catalogs.ProfileItem._ProfileName
DO NOT USE! For internal usage only!

Tekla.Structures.Catalogs.ProfileItem._TreePathString
For internal usage only!

Tekla.Structures.Catalogs.ProfileItem.ProfileItemType
The profile item type.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubType
The profile item subtype.

Tekla.Structures.Catalogs.ProfileItem.aProfileItemParameters
An array list with the profile item parameters.

Tekla.Structures.Catalogs.ProfileItem.Type
Whether the profile item is library or parametric.

Tekla.Structures.Catalogs.ProfileItem.ParametricProfileDefinitionType
The internal parametric profile item definition type.

Tekla.Structures.Catalogs.ProfileItem.ParameterString
The profile item parameter string.

Tekla.Structures.Catalogs.ProfileItem.NumberOfCrossSections
The number of cross sections in the profile item.

Tekla.Structures.Catalogs.ProfileItem.IsSketchedUserParametric
Whether the profile is a parametric user-defined sketched profile.
Returns:  True if the profile is a parametric user-defined sketched profile, false otherwise.

Tekla.Structures.Catalogs.ProfileItem.IsMultiCrossSectionUserParametric
Whether the profile is a parametric user-defined multi cross section profile.
Returns:  True if the profile is a parametric user-defined multi cross section profile, false otherwise.

Tekla.Structures.Catalogs.ProfileItem.IsProfileUserParametric
Whether the profile is a parametric user-defined profile. If so,
the prefix can be asked by type and subtype.
Returns: Whether the profile is a parametric user-defined profile or not.

Tekla.Structures.Catalogs.ProfileItem.IsProfileUserDefined
Whether the profile is a fixed user-defined profile.
Returns: Whether the profile is a fixed user-defined profile or not.

Tekla.Structures.Catalogs.ProfileItem.Select
Selects the profile item in the profile database.
Returns: True on success.

Tekla.Structures.Catalogs.ProfileItem.ModifyProfileItemParameter(Tekla.Structures.Catalogs.ProfileItemParameter)
Modify parameter of library profile item.
Modify is needed for profile item for updating changes to profile database
value: The modified parameter value for the profile item.
Returns: True on success.

Tekla.Structures.Catalogs.ProfileItem.ModifyProfileItemAnalysisParameter(Tekla.Structures.Catalogs.ProfileItemParameter)
Modify analysis parameter of library profile item.
Modify is needed for profile item for updating changes to profile database
value: The modified parameter value for the profile item.
Returns: True on success.

Tekla.Structures.Catalogs.ProfileItem.ModifyProfileItemUserParameter(Tekla.Structures.Catalogs.ProfileItemParameter)
Modify user parameter of library profile item.
Modify is needed for profile item for updating changes to profile database
Returns: True on success.

Tekla.Structures.Catalogs.ProfileItem.Export(System.String@)
Exports the profile item in the profile database to given file name.
Currently library profiles, sketch profiles and clb profiles are supported.
Library profiles are exported to *.lis format.
Sketch profiles are exported to *.uel format.
Clb profiles are exported to *.clb format.
If path is not given profile is exported to model folder.
If filename is empty profile name or prefix is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
LibraryProfileItem item = new LibraryProfileItem();
if (item.Select("HEA100"))
{
string filename = System.IO.Path.GetTempPath() + "\\" + "HEA100";
if (item.Export(ref filename))
{
Console.WriteLine("HEA100 exported successfully");
}
}
}
}
filename: The export file name of the profile item.
Returns: True on success.

Tekla.Structures.Catalogs.ProfileItem.ExportSameLevelProfilesWithTree(System.String,System.String)
Export profile tree based on tree node name.
treePathString: The treePathString to be used in export, level separated with '|'
fileName: The filename with optional path to be used for export.
Returns: true if successful.

Tekla.Structures.Catalogs.ProfileItem.GetCrossSection(System.Double)
Returns list of cross section points of inner surfaces from the profile item.
using System;
using Tekla.Structures.Catalogs;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
LibraryProfileItem item = new LibraryProfileItem();
if (item.Select("HEA100"))
{
var section = item.GetCrossSection();
if(section != null)
{
var outerSurface = section.OuterSurface;
if(outerSurface != null)
{
foreach (CrossSectionPoint point in outerSurface)
{
Console.WriteLine("Point " + string.Format("({0:0.000}, {1:0.000}, {2:0.000})", point.X, point.Y, point.Z));
Console.WriteLine("Chamfer type " + point.Chamfer.Type.ToString());
Console.WriteLine("Chamfer " + string.Format("({0:0.000}, {1:0.000}, {2:0.000}, {3:0.000})", point.Chamfer.X, point.Chamfer.Y, point.Chamfer.DZ1, point.Chamfer.DZ2));
}
var  outerSurfacePoints = section.OuterSurfacePoints;
if (outerSurfacePoints != null)
{
foreach (Point p in outerSurfacePoints)
{
Console.WriteLine("Point " + string.Format("({0:0.000}, {1:0.000}, {2:0.000})", p.X, p.Y, p.Z));
}
}
}
Console.WriteLine("HEA100 cross section points selected successfully");
}
}
}
}
RelativeLocation: The relative location of the cross section, values between 0 (start of profile) and 1 (end of profile).
Returns: List of inner cross section point lists on success, null on failure.

Tekla.Structures.Catalogs.ProfileItem.GetHighAccuracyCrossSection(System.Double)
Get cross section with high accuracy.
RelativeLocation: The relative location of the cross section, values between 0 (start of profile) and 1 (end of profile).
Returns: CrossSection object or null on failure.